backend/controllers/SuratJalanController.php

    public function actionUpdate($id)
    {
         if (Yii::$app->user->isGuest) {

			header("Location: index.php");

			exit();

		}
        $model = $this->findModel($id);
        $array_kota = kota::find()
            ->select(["kota as value", "id as id"])
            ->asArray()
            ->all();
        $array_unit = unit::find()
            ->select(["nopol as value", "id_unit as id"])
            ->asArray()
            ->all();
        $array_karyawan = karyawan::find()
            ->select(["nama as value", "id_karyawan as id"])
            ->asArray()
            ->all();

         $selected_kota = Kota::find()->where(['id' => $model->id_kota])->one();
---
SELECT * FROM `unit` WHERE `id_unit`=139