backend/views/layouts/left.php

		use backend\models\MenuNavigasi;
		use backend\models\MenuNavigasiRole;

			$hakakses = MenuNavigasiRole::find()->where(["in","id_system_role",Yii::$app->session->get('user_role_id')])->asArray()->all();

			$menu = MenuNavigasi::find()->where(["id_parent"=>0, "status"=>0])
			->andWhere(["in","id_menu",$hakakses])
			->orderBy("no_urut")->all();
---
SELECT * FROM `menu_navigasi_role` WHERE `id_system_role` IN (10, 4, 11, 9)
SELECT * FROM `menu_navigasi` WHERE ((`id_parent`=0) AND (`status`=0)) AND (`id_menu` IN ('117', '119', '118', '121', '7', '8', '132', '30', '14', '141', '144', '9', '11', '12', '21', '22', '96', '159', '161', '27', '28', '10', '143', '1')) ORDER BY `no_urut`


			foreach ($menu as $data)
			{
				$menu2 = MenuNavigasi::find()->where(["id_parent"=>$data->id_menu, "status"=>0])
				->andWhere(["in","id_menu",$hakakses])
				->orderBy("no_urut")->all();
---
SELECT * FROM `menu_navigasi` WHERE ((`id_parent`=1) AND (`status`=0)) AND (`id_menu` IN ('117', '119', '118', '121', '7', '8', '132', '30', '14', '141', '144', '9', '11', '12', '21', '22', '96', '159', '161', '27', '28', '10', '143', '1')) ORDER BY `no_urut`